bookers1-debug/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book = Book.new
    @books = Book.all

INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "aaaa"], ["created_at", "2020-03-01 03:41:34.334540"], ["updated_at", "2020-03-01 03:41:34.334540"], ["title", "aa"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book), notice: 'Book was successfully created.'
    else
      @books = Book.all

UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "update_title_a"], ["body", "update_body_b"], ["updated_at", "2020-03-01 04:26:14.759273"], ["id", 1]]
---
  def update
    if @book.update(book_params)