Bookers/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "リーダブルコード"], ["body", "より良いコードを書くためのシンプルで実践的なテクニック"], ["created_at", "2020-01-30 14:47:24.938974"], ["updated_at", "2020-01-30 14:47:24.938974"]]
---
  def create
  	  book = Book.new(book_params)
  	   if book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "22"], ["updated_at", "2020-02-02 02:05:19.290831"], ["id", 132]]
---
  def update
      book = Book.find(params[:id])
      book.update(book_params)