bookers2-debug/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "234"], ["body", "342"], ["user_id", 2], ["created_at", "2020-03-01 12:07:53.894758"], ["updated_at", "2020-03-01 12:07:53.894758"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to book_path(@book), notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "453"], ["updated_at", "2020-03-01 11:42:50.419354"], ["id", 4]]
---
  def update
  	@book = Book.find(params[:id])
  	if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def correct_user
    book = Book.find(params[:id])