bookers2-debug/app/controllers/users_controller.rb

  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。
---
SELECT "users".* FROM "users"

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "dddf9bd55e38c48b5358a03e5378dcd7c4236be41cc08df737f7370d15da"], ["updated_at", "2020-03-01 11:58:07.145344"], ["id", 2]]

  def baria_user
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]